mbsp/mbsportal-services/mbs-portal-pu-adapter/src/test/resources/pricing_dev_sample_message_1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header>
		<fnm:metadata xmlns:fnm="http://www.fanniemae.com/all"
			persist="true" split="false" version="1.0">
			<fnm:payloadIdentifier ID="DEFAULT" mask="false">
				<fnm:eventType>TBA</fnm:eventType>
				<fnm:entityType>PU_TBA_PRICING</fnm:entityType>
				<fnm:entityID>PU_TBA_PRICING</fnm:entityID>
			</fnm:payloadIdentifier>
			<fnm:credential>
				<fnm:source>NONE</fnm:source>
				<fnm:initiatingUserID>NONE</fnm:initiatingUserID>
			</fnm:credential>
			<fnm:system>
				<fnm:producer>PricingUtility</fnm:producer>
				<fnm:hostID>dlliquid-db20.fanniemae.com/10.215.111.155</fnm:hostID>
				<fnm:applicationID>BZH</fnm:applicationID>
			</fnm:system>
			<fnm:transaction>
				<fnm:messageID>22972fa3d37845e1b5674a424551bab4</fnm:messageID>
				<fnm:timestamp>04/11/2018 16:22:31:010</fnm:timestamp>
			</fnm:transaction>
			<fnm:routingProperties>
				<fnm:property name="environment">DEV</fnm:property>
			</fnm:routingProperties>
		</fnm:metadata>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<fnm:payload xmlns:fnm="http://www.fanniemae.com/all" ID="DEFAULT">{
			"prices": [
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.01_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-05-11T15:39:43.971-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 7.78125,
			"BidPrice": 7.8125,
			"Coupon": 0.01,
			"Forward": "1",
			"SettlementDate": "2018-06-18",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 7.796875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.015_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-05-11T15:44:22.512-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 108.4375,
			"BidPrice": 108.46875,
			"Coupon": 0.015,
			"Forward": "0",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 108.453125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.02_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:08:00.055-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 95.59375,
			"BidPrice": 95.5625,
			"Coupon": 0.02,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 95.578125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.02_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:08:00.107-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 95.53125,
			"BidPrice": 95.5,
			"Coupon": 0.02,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 95.515625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.02_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.130-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 95.171875,
			"BidPrice": 95.140625,
			"Coupon": 0.02,
			"Forward": "2",
			"SettlementDate": "2018-06-18",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 95.15625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.025_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:03:43.831-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 97.96875,
			"BidPrice": 97.9375,
			"Coupon": 0.025,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 97.953125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.025_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:03:56.312-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 97.875,
			"BidPrice": 97.84375,
			"Coupon": 0.025,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 97.859375
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.025_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-26T13:07:05.291-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 42.123,
			"BidPrice": 42.123,
			"Coupon": 0.025,
			"Forward": "2",
			"SettlementDate": "2018-07-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 42.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.03_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:06:31.345-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 99.890625,
			"BidPrice": 99.84375,
			"Coupon": 0.03,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 99.8671875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.03_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:06:30.952-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 99.78125,
			"BidPrice": 99.75,
			"Coupon": 0.03,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 99.765625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.03_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-25T11:13:36.704-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 82.123,
			"BidPrice": 82.123,
			"Coupon": 0.03,
			"Forward": "2",
			"SettlementDate": "2018-07-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 82.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.035_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:05:22.295-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.984375,
			"BidPrice": 101.953125,
			"Coupon": 0.035,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.96875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.035_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T15:05:22.295-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.8125,
			"BidPrice": 101.78125,
			"Coupon": 0.035,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.796875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.035_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-25T11:12:18.656-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 99.123,
			"BidPrice": 92.123,
			"Coupon": 0.035,
			"Forward": "2",
			"SettlementDate": "2018-07-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 91.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.04_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.186-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 102.84375,
			"BidPrice": 102.765625,
			"Coupon": 0.04,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 102.8046875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.04_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.170-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 102.8125,
			"BidPrice": 102.625,
			"Coupon": 0.04,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 102.71875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.04_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.166-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 102.734375,
			"BidPrice": 102.5,
			"Coupon": 0.04,
			"Forward": "2",
			"SettlementDate": "2018-06-18",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 102.6171875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.045_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.095-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 100.640625,
			"BidPrice": 100.609375,
			"Coupon": 0.045,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 100.625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.045_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.153-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 100.640625,
			"BidPrice": 100.609375,
			"Coupon": 0.045,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 100.625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.045_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-25T11:13:36.693-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 52.123,
			"BidPrice": 52.123,
			"Coupon": 0.045,
			"Forward": "2",
			"SettlementDate": "2018-07-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 52.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.05_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.118-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.453125,
			"BidPrice": 101.421875,
			"Coupon": 0.05,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.4375
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.05_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.154-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.5,
			"BidPrice": 101.46875,
			"Coupon": 0.05,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.484375
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.05_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.188-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.453125,
			"BidPrice": 101.421875,
			"Coupon": 0.05,
			"Forward": "2",
			"SettlementDate": "2018-06-18",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.4375
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.055_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.161-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.53125,
			"BidPrice": 101.5,
			"Coupon": 0.055,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.515625
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.055_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.165-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.46875,
			"BidPrice": 101.4375,
			"Coupon": 0.055,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.453125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.055_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-25T11:12:52.824-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 131.123,
			"BidPrice": 131.123,
			"Coupon": 0.055,
			"Forward": "2",
			"SettlementDate": "2018-07-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 131.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.06_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.092-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.984375,
			"BidPrice": 101.953125,
			"Coupon": 0.06,
			"Forward": "0",
			"SettlementDate": "2018-04-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.96875
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.06_FWD1",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.146-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.96875,
			"BidPrice": 101.9375,
			"Coupon": 0.06,
			"Forward": "1",
			"SettlementDate": "2018-05-17",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.953125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.06_FWD2",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-06T14:45:12.166-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 101.96875,
			"BidPrice": 101.9375,
			"Coupon": 0.06,
			"Forward": "2",
			"SettlementDate": "2018-06-18",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 101.953125
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.075_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-10T14:40:34.028-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 51.123,
			"BidPrice": 51.123,
			"Coupon": 0.075,
			"Forward": "0",
			"SettlementDate": "2018-05-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 51.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_PC_30Y_0.075_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-10T14:40:34.028-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 51.123,
			"BidPrice": 51.123,
			"Coupon": 0.075,
			"Forward": "0",
			"SettlementDate": "2018-05-12",
			"IssuingAgency": "FR",
			"Maturity": 180,
			"MidPrice": 51.123
			}
			}
			}
			},
			{
			"Collection": {
			"CollectionName": "FRM_MBS_TBA_FN_15Y_0.085_FWD0",
			"CollectionDataSource": "ExternalTick",
			"CollectionType": "LIVE",
			"CollectionObservationTime": "2018-04-10T14:40:15.363-04:00",
			"CollectionAttributes": {
			"SimpleAttributes": {
			"AskPrice": 51.123,
			"BidPrice": 51.123,
			"Coupon": 0.085,
			"Forward": "0",
			"SettlementDate": "2018-05-12",
			"IssuingAgency": "FN",
			"Maturity": 180,
			"MidPrice": 51.123
			}
			}
			}
			}
			]
			}
		</fnm:payload>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>